Repository: flammie/purplemonkeydishwasher
Catalog: 2016-iwclul/et-fi (1).tmx
Source language: et
Languages: fi

source: Sa pead täpsustama versiooni, milleni %s madaldada
fi: Valitse, mihin versioon %s:n versio pudotetaan

source: Hiljutine versioon %s %s on juba paigaldatud
fi: %s:n uudempi versio %s on jo asennettuna

source: Pakett %s pole %s väljalaskes saadaval
fi: Paketti %s ei ole tarjolla julkaisussa %s.

source: Pakett %s ei ole eemaldatav
fi: Pakettia %s ei voi poistaa

source: Pakett ei paku kehtivat juhtvälja paigaldussuurust. Vaata Debiani poliitikat 5.6.20.
fi: Paketti ei sisällä kelvollista Installed-Size-kenttää. Lisätietoja: Debian Policy 5.6.20.

source: Litsentsivõti on tühi
fi: Lisenssiavain on tyhjä

source: Litsentsivõti ei tohi sisaldada käivitatavat koodi
fi: Lisenssiavain ei saa sisältää ajettavaa koodia

source: Litsentsivõtme asukoht %s on vigane
fi: Lisenssiavaimen polku %s on virheellinen

source: Litsentsivõti on juba olemas: %s
fi: Lisenssiavain on jo olemassa: %s

source: Järgmistel pakettidel on lahendamata sõltuvused:
fi: Seuraavien pakettien riippuvuuksia ei ole toteutettu:

source: aga see on virtuaalne pakett
fi: mutta se on virtuaalinen paketti

source: aga see pole paigaldatud
fi: mutta sitä ei ole asennettu

source: aga seda ei paigaldata
fi: mutta sitä ei olla asentamassa

source: aga %s on paigaldatud
fi: mutta %s on asennettu

source: aga %s paigaldatakse
fi: mutta %s tullaan asentamaan

source: errorIgn
fi: Nouda:errorIgn

source: ERRERROR
fi: Vakiosyötevirta loppui odottamattaERRERROR

source: Localized defaults_BAR_aptitude-defaults.ww
fi: Haluat ehkä päivittää pakettiluettelon korjataksesi nämä puuttuvat tiedostotLocalized defaults_BAR_aptitude-defaults.ww

source: tõrge andmebaasi %s laadimisel.
fi: Tietokantaa %s ei voitu ladata.

source: Tundmatu liides: %s
fi: Tuntematon edustaohjelma: %s

source: %s: paigaldatakse uuesti
fi: %s on uusi asennus

source: %s: Versiooni %s on juba nähtud
fi: Paketin %s versio %s on nähty aiemmin

source: Paki %s uudised
fi: Uutiset paketille %s

source: Paki %s muudatused
fi: Muutokset pakettiin %s

source: Teavitavad märkused
fi: Tiedotukset

source: apt-listchanges: Uudised
fi: apt-listchanges: Uutiset

source: apt-listchanges: Muudatuste logid
fi: apt-listchanges: Muutoslokit

source: Katkestamine
fi: Peruutetaan

source: Tõrge kinnituse saamisel, nähtud olekut ei salvestata
fi: Vahvistus epäonnistui, ei tallenneta nähty-tilaa

source: apt-listchanges: hosti %s muudatuste logid
fi: apt-listchanges: muutoslokit koneelta %s

source: apt-listchanges: hosti %s uudised
fi: apt-listchanges: uutiset koneelta %s

source: ühtegi töökorras .deb arhiivi pole võimalik leida
fi: en löytänyt kelvollisia .deb-arkistoja

source: Kasutamine: apt-listchanges [võtmed] {--apt _BAR_ failinimi.deb ...}
fi: Käyttö: apt-listchanges [valitsimet] {{--apt _BAR_ tiedostonimi.deb ...}

source: Tundmatu argument %s võtme --which jaoks. Võimalikud variandid: %s
fi: Tuntematon valitsin %s käytettäessä --which. Sallittuja ovat: %s.

source: Kas jätkata paigaldusega?
fi: Jatketaanko asennusta?

source: Valiku 'ei' korral paigaldamine katkestatakse.
fi: Voit keskeyttää asennuksen valitsemalla "ei"

source: '%s' eiramine (paistab, et see on kataloog!)
fi: Ohitetaan ”%s” (vaikuttaa olevan hakemisto)

source: Vale või puuduv VERSION apt torust (kas Dpkg::Tools::Options::/usr/bin/apt-listchanges::Version on 2?)
fi: Väärä tai puuttuva VERSION putkessa aptilta (onko Dpkg::Tools::Options::/usr/bin/apt-listchanges::Version arvoltaan 2?)

source: Postitamine %s: %s
fi: Lähetetään: %s: %s

source: Liides %s on aegunud, kasutatakse lehitsejat
fi: %s-edustaohjelma on vanhentunut, käytän sivutinta

source: E-posti liidese jaoks on vaja, et 'sendmail' oleks paigaldatud. Kasutatakse lehitsejat
fi: Sähköpostiedusohjelma tarvitsee asennetun sendmail-paketin, käytetään sivutinta (pager)

source: Gtk liidese jaoks on vaja töötavaid python-gtk2 ja python-glade2 teeke. Neid teeke pole paraku võimalik leida. Gtk asemel kasutatakse lehitsejat. Veateade: %s
fi: gtk-edusohjelma tarvitsee toimivat paketit python-gtk2 ja python-glade2. Kyseisiä moduuleita ei voi tuoda. Palataan käyttämään sivutinta (pager). Virhe oli: %s

source: Kas soovid jätkata [J/e]
fi: Haluatko jatkaa? [Kyllä=y/ei=n]

source: Muudatuste logide lugemine
fi: Luetaan muutoslokeja

source: Korras
fi: Valmis

source: Katkestatud kasutaja soovil.
fi: Keskeytetty käyttäjän pyynnöstä.

source: Ebakorrektsed märgid URIs
fi: Osoitteessa on siihen kelpaamaton merkki

source: Tühik võti=väärtus paaris
fi: Välilyönti avain-arvoparissa (avain=arvo)

source: Erand '%s'
fi: Poikkeus "%s"

source: URL string '%s' on liiga pikk
fi: Url-merkkijono '%s' on liian pitkä

source: URIs puudub koolon ':'
fi: Osoitteessa ei ole kaksoispistettä (":")

source: '%s' aktiveerimine ebaõnnestus
fi: "%s" käyttöönotto epäonnistui

source: Tundmatu kanal '%s'
fi: Tuntematon kanava "%s"

source: Kanal '%s' ei ole teada
fi: Kanavaa "%s" ei tunnistettu

source: Kanali '%s' lubamine ebaõnnestus
fi: Kanavan "%s" käyttöönotto epäonnistui

source: Vigane /etc/apt/sources.list fail
fi: Virheellinen /etc/apt/sources.list-tiedosto

source: Katkine tarkvaraindeks
fi: Ohjelmaluettelo on rikkinäinen

source: Tarkvara haldamise süsteemis tekkis suur viga. Otsi Synapticuga katkisi pakette, kontrolli failide õigusi ja faili '/etc/apt/sources.list' korrektsust. Seejärel uuenda tarkvara informatsiooni järgmise käsuga: 'sudo apt-get update' and 'sudo apt-get install -f'.
fi: Tämä on isohko virhe pakettienhallintajärjestelmässä. Tarkista rikkinäiset paketit Synaptic-ohjelmalla, tarkista "/etc/apt/sources.list"-tiedoston oikeudet ja sisällön virheettömyys, ja lataa ohjelmaluettelotiedot uudelleen komennoilla:"sudo apt-get update" ja "sudo apt-get install -f".

source: Jätkamiseks on vaja URLi, väljumine
fi: URL tarvitaan, jotta voitaisiin jatkaa. Poistutaan.

source: Sisestatud vigane url: '%s', väljumine
fi: Virheellinen URL annettu:"%s". Poistutaan.

source: Ei oska kasutada protokolli '%s'
fi: Yhteyskäytäntöä "%s" ei voi käsitellä.

source: Pakk '%s' on virtuaalne.
fi: Paketti "%s" on virtuaalinen.

source: Paketti '%s' ei õnnestunud leida
fi: Pakettia "%s" ei löydy.

source: Pakett '%s' on juba paigaldatud
fi: Paketti "%s" on jo asennettu

source: Paketti '%s' (%s) pole võimalik paigaldada
fi: Ei voi asentaa "%s" (%s)

source: Pakett '%s' vajab töötamiseks vähemalt '%s' versiooni, aga ainult '%s' on saadaval
fi: Paketti "%s" vaatii vähintään version "%s", mutta vain "%s" on saatavilla

source: Lisakomponentide aktiveerimine
fi: Otetaan käyttöön lisäkomponentteja

source: Täiendava tarkvarakanali aktiveerimine
fi: Ota käyttöön ohjelmakanava

source: Soovite lülitada sisse tarkvarakanali '%s'?
fi: Haluatko ottaa käyttöön ohjelmakanavan "%s"?

source: Kas paigaldada lisatarkvara?
fi: Asenna lisää ohjelmia?

source: Kas soovid paigaldada paketi '%s'?
fi: Haluatko asentaa paketin "%s"?

source: Kirjeldus
fi: Kuvaus

source: _Paigalda
fi: _Asenna

source: Kas määratud käsku peaks kasutama "apt" URLide puhul
fi: Käsitteleekö määritelty komento "apt"-URL-osoitteet

source: Kui märgitud, siis kasutatakse "apt" URLide puhul "käsu" võtmes määratud käsku.
fi: Tosi, jos komennon tulisi käsitellä "apt" -URLit.

source: "Apt" URLide käitleja
fi: "apt" -osoitteiden käsittelijä

source: Käsk, mida kasutada "apt" URLide jaoks, kui need on lubatud.
fi: Komento, jolla "apt"-osoitteet käsitellään.

source: Käivita käsk terminalis
fi: Suorita komento päätteessä

source: Kui märgitud, siis seda liiki URLide jaoks kasutatav käsk käivitatakse terminalis.
fi: Tosi, jos tämäntyyppisen URL:n käsittelyyn käytettävä komento tulisi ajaa päätteessä.

source: Paketi %s versioonil %s on lahendamata sõltuvusi:
fi: Paketin %s versiossa %s on tyydyttämätön riippuvuus:

source: Pakettide nimesid kokku:
fi: Pakettien kokonaismäärä :

source: Tavapakette:
fi: Tavallisia paketteja:

source: Puhtalt virtuaalseid pakette:
fi: Aitoja näennäispaketteja:

source: Üksikuid virtuaalseid pakette:
fi: Yksinkertaisia näennäispaketteja:

source: Kombineeritud virtuaalseid pakette:
fi: Sekanäennäispaketteja:

source: Puudu:
fi: Puuttuu:

source: Kokku erinevaid versioone:
fi: Eri versioita yhteensä:

source: Erinevaid kirjeldusi kokku:
fi: Eri kuvauksia yhteensä:

source: Sõltuvusi kokku:
fi: Riippuvuuksia yhteensä:

source: Versioonide/failide seoseid kokku:
fi: Versio/tdsto suhteita yht:

source: Kirjelduste/failide seoseid kokku:
fi: Kuvaus/tdsto suhteita yht:

source: Pakutavaid vastendusi kokku:
fi: Tarjoamiskuvauksia yhteensä:

source: Mustriga sobitatud stringe kokku:
fi: Erilaisia merkkijonoja yhteensä:

source: Üldine versioonisõltuvus:
fi: Versioriippuvuustila yhteensä:

source: Lõtkukohti kokku:
fi: Löysää tilaa yhteensä:

source: Kogu mahu aruandlus:
fi: Käytetty tila yhteensä:

source: Paketifail %s on sünkroonist väljas.
fi: Pakettitiedosto %s ei ole ajan tasalla.

source: Ei leitud ühtegi paketti
fi: Yhtään pakettia ei löytynyt

source: Paketifailid:
fi: Pakettitiedostot:

source: Vahemälu on sükroonist väljas, ei saa paketifaili võrrelda
fi: Varasto ei ole ajan tasalla, pakettitiedostoa ei löydy kansiosta

source: Naelutatud paketid:
fi: Paketit joissa tunniste:

source: (ei leitud)
fi: (ei löydy)

source: Paigaldatud:
fi: Asennettu:

source: Kandidaat:
fi: Ehdokas:

source: (ei ole)
fi: (ei mitään)

source: Paketi naelutus:
fi: Paketin tunnistenumero:

source: Versioonitabel:
fi: Versiotaulukko:

source: %s %s %s jaoks kompileeritud %s %s 'el
fi: %s %s laitealustalle %s käännöksen päiväys %s %s

source: Palun anna kettale nimi, nagu näiteks 'Debian 5.0.3 ketas 1'
fi: Anna nimi tälle levylle, esimerkiksi 'Debian 5.0.3 levy 1'

source: Palun sisesta ketas lugejasse ja vajuta enter
fi: Aseta levy asemaan ja paina Enter

source: '%s'-i ei õnnestunud ühendada '%s'-ga
fi: Laitteen '%s' liittäminen polkuun '%s' epäonnistui

source: Korda toimingut ülejäänud CD-dega oma komplektis.
fi: Toista tämä prosessi lopuille CD-levyille.

source: Argumendid pole paarides
fi: Parametrit eivät ole pareittain

source: Kasutamine: apt-config [võtmed] käsk apt-config on lihtne tööriist APTi seadistuste faili lugemiseks Käsud: shell - shelli režiim dump - seadistuste näitamine Võtmed: -h See abitekst. -c=? Selle seadistuste faili lugemine -o=? Suvalise valiku määramine, nt -o dir::cache=/tmp
fi: Käyttö: apt-config [valitsimet] komento apt-config on yksinkertainen työkalu APT:n asetustiedoston lukemiseen Komennot: shell - Muista ohjelmista käytettäväksi dump - Näytä asetukset Valitsimet: -h Tämä ohje -c=? Lue tämä asetustiedosto -o=? Aseta mikä asetusvalitsin tahansa, esim. -o dir::cache=/tmp

source: %s pole õige DEB pakett.
fi: %s ei kelpaa DEB-paketiksi.

source: Kasutamine: apt-extracttemplates fail1 [fail2 ...] apt-extracttemplates on tööriist seadistus- ja malliteabe kätte saamiseks debiani pakettidest Võtmed: -h See abitekst -t Ajutise kataloogi määramine -c=? Selle seadistuste faili lugemine -o=? Suvalise valiku määramine, nt -o dir::cache=/tmp
fi: Käyttö: apt-extracttemplates tdsto1 [tdsto2 ...] apt-extracttemplates on työkalu asetus- ja mallitietojen poimintaan debian-paketeista Valitsimet: -h Tämä ohje -t Aseta väliaikaisten tiedostojen kansio -c=? Lue tämä asetustiedosto -o=? Aseta mikä asetusvalitsin tahansa, esim. -o dir::cache=/tmp

source: Ei saa kirjutada %s -i
fi: Tiedostoon %s kirjoittaminen ei onnistu

source: Debconfi versiooni ei õnnestu tuvastada. Kas debconf on paigaldatud?
fi: Ohjelman debconf versiota ei saa selvitettyä. Onko debconf asennettu?

source: Paketi laienduste loend on liiga pikk
fi: Paketin laajennuslista on liian pitkä

source: Viga kataloogi %s töötlemisel
fi: Tapahtui virhe käsiteltäessä kansiota %s

source: Allika laienduste loend on liiga pikk
fi: Lähteiden laajennuslista on liian pitkä

source: Viga sisufailile päise kirjutamisel
fi: Tapahtui virhe kirjoitettaessa otsikkotietoa sisällysluettelotiedostoon

source: Viga %s sisu töötlemisel
fi: Tapahtui virhe käsiteltäessä sisällysluetteloa %s

source: Kasutamine: apt-ftparchive [võtmed] käsk Käsud: packages binarypath [overridefile [pathprefix]] sources srcpath [overridefile [pathprefix]] contents path release path generate config [groups] clean config apt-ftparchive genereerib Debiani arhiividele indeksifaile. See toetab mitmeid genereerimise stiile, alates täisautomaatsest kuni funktisionaalsete asendusteni ja dpkg-scanpackages ja dpkg-scansources jaoks apt-ftparchive genereerib .deb failide puust paketifaile. Paketifail sisaldab kõigi pakettide kontrollväljade sisu, MD5 räsi ja failisuurust. Toetatud on ka ülekirjutamise fail, et saaks Priority ja Section väärtuseid peale suruda. Sarnaselt genereerib apt-ftparchive .dscs failide puust lähtekoodi. src ülekirjutamise faili määramiseks saab kasutada võtit --source-override Käsud 'packages' ja 'sources' tuleks käivitada puu juurkaustas. BinaryPath peaks viitama tagurpidi otsingu põhjale ja ülekirjutusfail peaks sisaldama ülekirjutuslippe. Pathprefix lisatakse selle olemasolul failinime väljadele. Näidiskasutus Debiani arhiivist: apt-ftparchive packages dists/potato/main/binary-i386/ > \\ dists/potato/main/binary-i386/Packages Võtmed: -h See abitekst --md5 MD5 genereerimise juhtimine -s=? Lähtekoodi ülekirjutamise fail -q Vaikne -d=? Valikulise puhverandmebaasi valimine --no-delink Lahtiühendamise silumisržiimi lubamine --contents Sisufaili genereerimise juhtimine -c=? Selle seadistuste faili lugemine -o=? Suvalise seadistusvaliku määramine
fi: Käyttö: apt-ftparchive [valitsimet] komento Komennot: packages binääripolku [poikkeustdsto [polun alku]] sources lähdepolku [poikkeustdsto [polun alku]] contents polku release polku generate asetukset [ryhmät] clean asetukset apt-ftparchive tuottaa hakemistoja Debianin arkistoista. Monta tuottamistapaa on tuettu alkaen täysin automaattisista toiminnallisesti samoihin kuin dpkg-scanpackages ja dpkg-scansources. apt-ftparchive tuottaa pakettitiedostoja .deb-tiedostojen puusta. Pakettitiedostossa on kunkin paketin kaikkien ohjauskenttien sisältö sekä MD5 tiiviste ja tiedoston koko. Poikkeus- tiedostolla voidaan arvot Priority ja Section pakottaa halutuiksi. Samaan tapaan apt-ftparchive tuottaa lähdetiedostoja .dscs-tiedostojen puusta. Valitsimella --source-overrride voidaan määrittää lähteiden poikkeustiedosto. Komennot "packages" ja "sources" olisi suoritettava puun juuressa. Binääripolun olisi osoitettava rekursiivisen haun alkukohtaan ja poikkeustiedostossa olisi oltava poikkeusilmaisimet. Polun alku yhdistetään tiedoston nimeen jos se on annettu. Esimerkki käytöstä Debianin arkiston kanssa: apt-ftparchive packages dists/potato/main/binary-i386/ > \\ dists/potato/main/binary-i386/Packages Valitsimet: -h Tämä ohje --md5 MD5 luonti -s=? Lähteiden poikkeustdosto -q Ei tulostusta -d=? Valinnainen välimuistitietokanta --no-delink delinking-virheenjäljitys päälle --contents Sisällysluettelotiedoston luonti -c=? Lue tämä asetustiedosto -o=? Aseta mikä asetusvalitsin tahansa

source: Valikud ei kattunud
fi: Mitkään valinnat eivät täsmänneet

source: Paketi failigrupist `%s' on osa faile puudu
fi: Pakettitiedostojen ryhmästä "%s" puuttuu joitain tiedostoja

source: Andmebaas oli vigane, fail nimetati ümber %s.old
fi: Tietokanta on turmeltunut, tiedosto nimetty %s.old

source: Andmebaas on vana, toimub katse %s -i uuendada
fi: Tietokanta on vanha, yritetään päivittää %s

source: Andmebaasi vorming on vigane. Kui sa uuendasid apt-i vanemast versioonist, siis palun eemalda ja loo andmebaas uuesti.
fi: Tietokanta on viallinen. Jos olet päivittänyt vanhemmasta apt:n versiosta, poista ja luo tietokanta uudelleen.

source: Andmebaasi faili %s: %s ei saa avada
fi: Tietokantatiedostoa %s ei saatu avattua: %s

source: Faili %s teabe hankimine ebaõnnestus
fi: Tiedostolle %s ei toimi stat

source: Arhiivil pole juhtandmeid
fi: Arkistolla ei ole ohjaustietuetta

source: Kursorit ei saa hõivata
fi: Kohdistinta ei saada

source: W: Kataloogi %s lugemine ebaõnnestus
fi: W: Kansiota %s ei voi lukea

source: W: Faili %s teabe hankimine ei ole võimalik
fi: W: Tdstolle %s ei toimi stat

source: E: Vead kehtivad failile
fi: E: Tiedostossa virheitä

source: %s ei lahendu
fi: Osoitteen %s selvitys ei onnistunut

source: %s ei avane
fi: Tiedoston %s avaaminen ei onnistunut

source: %s lahtiühendamine nurjus
fi: unlink %s ei onnistunut

source: *** %s-i %s-iga ühendamine nurjus
fi: *** Linkin %s -> %s luonti ei onnistunut

source: Arhiivil ei olnud paketivälja
fi: Arkistossa ei ollut pakettikenttää

source: %s-l pole tühistamise kirjet
fi: %s:llä ei ole poikkeustietuetta

source: %s hooldaja on %s, mitte %s
fi: %s ylläpitäjä on %s eikä %s

source: %s-l pole lähtekoodi ülekirjutamise kirjet
fi: %s:llä ei ole poikkeustietuetta

source: %s-l pole ka binaarfaili ülekirjutamise kirjet
fi: %s:llä ei ole binääristäkään poikkeustietuetta

source: realloc - Mälu eraldamine nurjus
fi: realloc - Muistin varaaminen ei onnistunut

source: %s avamine pole võimalik
fi: Tiedoston %s avaaminen ei onnistunut

source: Ülekirjutusfaili %s lugemine nurjus
fi: Poikkeustiedoston %s lukeminen ei onnistunut

source: Tundmatu tihendusalgoritm '%s'
fi: Tuntematon pakkausalgoritmi "%s"

source: Pakitud väljund %s vajab määratud pakkimist
fi: Pakattu tulostus %s tarvitsee pakkausjoukon

source: Alamtöötluseks IPC toru loomine nurjus
fi: IPC-putken luominen aliprosessiin ei onnistunut

source: Faili FILE* loomine nurjus
fi: FILE* luominen ei onnistunut

source: Harunemine nurjus
fi: fork ei onnistunut

source: Lapsprotsessi kokkupakkimine
fi: Compress-lapsiprosessi

source: Sisemine viga, %s loomine nurjus
fi: Sisäinen virhe, prosessin %s luominen ei onnistunut

source: SV alamprotsessi/faili nurjus/
fi: Syöttö/tulostus aliprosessiin/tiedostoon ei onnistunut

source: MD5 arvutamise ajal lugemine nurjus
fi: Lukeminen ei onnistunut laskettaessa MD5:ttä

source: Probleem %s-i lahtiühendamisega
fi: Ilmeni pulmia poistettaessa tiedosto %s

source: %s ümbernimetamine %s-ks nurjus
fi: Nimen muuttaminen %s -> %s ei onnistunut

source: Y
fi: K

source: Regulaaravaldise kompileerimise viga - %s
fi: Käännösvirhe lausekkeessa - %s

source: Järgmistel pakettidel on lahendamata sõltuvusi:
fi: Näillä paketeilla on tyydyttämättömiä riippuvuuksia:

source: aga %s on juba paigaldatud
fi: mutta %s on asennettu

source: aga %s -i juba paigaldatakse
fi: mutta %s on merkitty asennettavaksi

source: aga seda ei ole võimalik paigaldada
fi: mutta ei ole asennuskelpoinen

source: aga seda ei ole veel paigaldatud
fi: mutta ei ole asennettu

source: või
fi: tai

source: Paigaldatakse järgnevad UUED paketid:
fi: Seuraavat UUDET paketit asennetaan:

source: EEMALDATAKSE järgnevad paketid:
fi: Seuraavat paketit POISTETAAN:

source: Järgnevaid pakette hoiti tagasi:
fi: Nämä paketit on jätetty odottamaan:

source: Uuendatakse järgnevaid pakette:
fi: Nämä paketit päivitetään:

source: Järgnevatest pakettidest paigaldatakse VANEMAD VERSIOONID:
fi: Nämä paketit VARHENNETAAN:

source: Muudetakse järgnevaid ootel pakette
fi: Seuraavat pysytetyt paketit muutetaan:

source: %s (%s tõttu)
fi: %s (syynä %s)

source: HOIATUS: Järgnevad olulised paketid eemaldatakse. See EI OLE soovitatav juhul, kui sa ei tea täpselt, mida teed.
fi: VAROITUS: Seuraavat välttämättömät paketit poistetaan. Näin EI PITÄISI tehdä jos ei aivan tarkkaan tiedä mitä tekee!

source: %lu uuendatud, %lu värskelt paigaldatud,
fi: %lu päivitetty, %lu uutta asennusta,

source: %lu uuesti paigaldatud,
fi: %lu uudelleen asennettua,

source: %lu vanem versioon paigaldatud,
fi: %lu varhennettua,

source: %lu eemaldada ja %lu uuendamata.
fi: %lu poistettavaa ja %lu päivittämätöntä.

source: %lu pole täielikult paigaldatud või eemaldatud
fi: %lu ei asennettu kokonaan tai poistettiin.

source: Pakett %s on virtuaalne pakett, mida pakub:
fi: Paketti %s on näennäispaketti, jonka kattaa:

source: [Paigaldatud]
fi: [Asennettu]

source: Sa peaksid paigalduseks ühe valima.
fi: Yksi pitää valita asennettavaksi.

source: Pakett %s pole saadaval, aga teine pakett viitab sellele. See võib tähendada, et pakett puudub, on aegunud või on saadaval ainult teisest allikast.
fi: Pakettia %s ei ole saatavilla, mutta toinen paketti viittaa siihen. Tämä voi tarkoittaa paketin puuttuvan, olevan vanhentunut tai saatavilla vain jostain muusta lähteestä

source: Kuid järgnevad paketid asendavad selle:
fi: Seuraavat paketit kuitenkin korvaavat sen:

source: %s jäetakse vahele, see on juba paigaldatud ja uuendamist pole määratud.
fi: Ohitetaan %s, se on jo asennettu eikä ole komennettu päivitystä.

source: Paketi %s uuesti paigaldamine pole võimalik, seda ei saa alla laadida.
fi: Paketin %s uudelleenasennus ei ole mahdollista, sitä ei voi noutaa.

source: %s on juba kõige uuem versioon.
fi: %s on jo uusin versio.

source: %s on määratud käsitsi paigaldatuks.
fi: %s on merkitty käyttäjän toimesta asennetuksi.

source: Paketti %s ei eemaldatud, kuna seda ei ole paigaldatud
fi: Pakettia %s ei ole asennettu, niinpä sitä ei poisteta

source: Sõltuvuste parandamine...
fi: Korjataan riippuvuuksia...

source: nurjus.
fi: ei onnistunut.

source: Ei suuda sõltuvusi parandada
fi: Riippuvuuksien korjaus ei onnistu

source: Värskenduste komplekti ei saa minimeerida
fi: Päivitysjoukon minimointi ei onnistu

source: Lahendamata sõltuvused. Proovi võtmena kasutada -f.
fi: Tyydyttämättömiä riippuvuuksia. Koita käyttää -f.

source: HOIATUS: Järgnevaid pakette ei õnnestunud autentida.
fi: VAROITUS: Seuraavien pakettien alkuperää ei voi varmistaa!

source: Autentimise hoiatus tühstatud.
fi: Varoitus varmistamisesta on ohitettu.

source: Kas paigaldada need paketid ilma kontrollimata [y/N]?
fi: Asennetaanko nämä paketit ilman todennusta [y/N]?

source: Mõnda paketti ei saanud autentida
fi: Joidenkin pakettien alkuperästä ei voitu varmistua

source: On probleeme ja -y kasutati ilma võtmeta --force-yes
fi: Oli pulmia ja -y käytettiin ilman valitsinta --force-yes

source: Sisemine viga, InstallPackages kutsuti välja katkiste pakettidega!
fi: Sisäinen virhe, InstallPackages kutsuttiin rikkinäisille paketeille!

source: Paketid tuleb eemaldada, aga eemaldamine on keelatud.
fi: Paketteja pitäisi poistaa mutta Remove ei ole käytössä.

source: Sisemine viga, järjestamine ei saanud valmis
fi: Tapahtui sisäinen virhe, järjestäminen keskeytyi

source: Imelik.. Suurused ei kattunud, saada e-kiri aadressile apt@packages.debian.org
fi: No jo on... Koot eivät täsmää, sähköpostita email apt@packages.debian.org

source: On vaja tõmmata %sB/%sB arhiive.
fi: Noudettavaa arkistoa %st/%st.

source: On vaja tõmmata %sB arhiive.
fi: Noudettavaa arkistoa %st.

source: Selle tegevuse tulemusel kasutatakse %sB lisa kettaruumi.
fi: Tämän toiminnon jälkeen käytetään %sB lisää levytilaa.

source: Pärast seda tegevust vabaneb %sB kettaruumi.
fi: Tämän toiminnon jälkeen vapautuu %sB levytilaa.

source: Ei suutnud tuvastada vaba ruumi kettal %s
fi: Kansion %s vapaan tilan määrä ei selvinnyt

source: Sul pole kettal %s piisavalt vaba ruumi.
fi: Kansiossa %s ei ole riittävästi vapaata tilaa.

source: Määratud on ainult triviaalne, aga see pole triviaalne tegevus.
fi: On määritetty Trivial Only mutta tämä ei ole itsestäänselvä toimenpide.

source: Jah, tee nagu ma ütlen!
fi: Kyllä, tee kuten käsketään!

source: Sa kavatsed teha midagi potensiaalselt kahjulikku. Jätkamiseks trüki '%s' ?]
fi: Olet aikeissa tehdä mahdollisesti vahingollisen toimenpiteen. Jatka kirjoittamalla "%s" ?]

source: Katkesta.
fi: Keskeytä.

source: Kas tahad jätkata [Y/n]?
fi: Haluatko jatkaa [K/e]?

source: %s %s tõmbamine nurjus
fi: Tiedoston %s nouto ei onnistunut %s

source: Mõne faili allalaadimine nurjus
fi: Joidenkin tiedostojen nouto ei onnistunut

source: Allalaadimine lõpetatud ja ainult allalaadimise režiimis
fi: Nouto on valmis ja määrätty vain nouto
